# GetBasisSurface Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OffsetSurface..::..GetBasisSurface Method
OffsetSurface Class See Also
---
Returns a copy of basis surface of this OffsetSurface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Surface GetBasisSurface()
```

Visual Basic
---
```text
Public Function GetBasisSurface As Surface
```

Visual C++
---
```text
public:
Surface^ GetBasisSurface()
```

# ### Return Value
Basis surface of this OffsetSurface.
# See Also
OffsetSurface Class
Autodesk.Revit.DB Namespace